{
  "backend/main.mo": "Motoko actor managing contact submissions and service inquiries per principal with admin-controlled access and deletion logic.",
  "feature_evidence.json": "Defines feature evidence entries listing implemented features, affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend source files used for build planning and documentation.",
  "frontend/index.css": "Global Tailwind and CSS variable definitions for theming, including light/dark OKLCH color tokens and base styles.",
  "frontend/index.html": "HTML entry point defining SEO meta tags, language settings, root app container, and script loading.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, theme provider, React Query, and linking all pages including Privacy Policy.",
  "frontend/src/components/About.tsx": "About section component with multilingual content, founder info, mission statement, and feature cards.",
  "frontend/src/components/Contact.tsx": "Contact form component handling service inquiries with validation, translations, actor mutation calls, and UI cards.",
  "frontend/src/components/Footer.tsx": "Renders a multilingual footer with quick links, services list, contact info, and social icons, using navigation and language-based translations.",
  "frontend/src/components/Header.tsx": "Creates a responsive, bilingual header with navigation, language switching, call button, and mobile menu behavior.",
  "frontend/src/components/Hero.tsx": "Displays a bilingual hero section with branding, headlines, background visuals, and CTA buttons for services and WhatsApp.",
  "frontend/src/components/Layout.tsx": "Wraps the app with a language context and renders the header, routed content, and footer.",
  "frontend/src/components/PaymentTerms.tsx": "Fetches and shows payment term percentages with translations, including loading skeletons and styled cards.",
  "frontend/src/components/RateList.tsx": "Loads pricing data, applies a 20% discount, and displays multilingual package cards and optional extra services.",
  "frontend/src/components/Services.tsx": "Fetches services through an actor, adds extra design-related items, and displays them with icons and featured highlighting.",
  "frontend/src/components/SpecialOffers.tsx": "Shows two promotional offers with images and CTA buttons, using language-based translations.",
  "frontend/src/components/WhyChooseUs.tsx": "Renders a translated list of reasons to choose the service provider, each with an icon and description.",
  "frontend/src/components/WorkProcess.tsx": "Loads work process steps from the actor and displays them in a four-step layout with icons and numbering.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating service, pricing, submissions, and inquiry data through an ICP actor.",
  "frontend/src/index.css": "Configures Tailwind layers, custom CSS variables, themes, utility classes, and animations for the app.",
  "frontend/src/main.tsx": "Initializes React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AdminPage.tsx": "Implements an admin login interface and displays submission and inquiry management tools after authentication.",
  "frontend/src/pages/HomePage.tsx": "Renders the main homepage sections using various components with language-based content.",
  "frontend/src/pages/OffersPage.tsx": "Shows promotional offers with multilingual support, UI components, and navigation actions.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays a styled, static privacy policy with sections outlining data collection and usage.",
  "frontend/src/pages/ServicesPage.tsx": "Renders services, pricing, workflow, and payment terms sections based on selected language.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and manage hash-based query cleanup.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project metadata, existing features, pending requests, and overall website configuration state."
}